# GetNumberOfLines Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AreaReinforcement..::..GetNumberOfLines Method
AreaReinforcement Class See Also
---
Gets the number of lines on the specified layer. It also counts the excluded ones.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public int GetNumberOfLines(
	AreaReinforcementLayerType layer
)
```

Visual Basic
---
```text
Public Function GetNumberOfLines ( _
	layer As AreaReinforcementLayerType _
) As Integer
```

Visual C++
---
```text
public:
int GetNumberOfLines(
	AreaReinforcementLayerType layer
)
```

# ### Parameters
layer
    Type: Autodesk.Revit.DB.Structure..::..AreaReinforcementLayerType The layer type for which will return the number of lines.
# ### Return Value
Returns the number of lines on the specified layer.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions..::..InapplicableDataException | The layer layer isn't active. |

# See Also
AreaReinforcement Class
Autodesk.Revit.DB.Structure Namespace